Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateBalusterPatterns Property
 Can't create Baluster Patterns for Railings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateBalusterPatterns { get; }
Public Shared ReadOnly Property CannotCreateBalusterPatterns As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateBalusterPatterns {
	FailureDefinitionId^ get ();
}
static member CannotCreateBalusterPatterns : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace